a = 5
b = 5
# 比較演算子==を使用して、aとbが等しい場合はTrueを返す
print(a == b)

a = 5
b = 3
# 比較演算子==を使用して、aとbが異なる場合はFalseを返す
print(a == b)


a = 7
b = 4
# 比較演算子!=を使用して、aとbが異なる場合はTrueを返す
print(a != b)

a = 7
b = 7
# 比較演算子!=を使用して、aとbが等しい場合はFalseを返す
print(a != b)


a = 10
b = 8
# 比較演算子>を使用して、aがbより大きい場合はTrueを返す。比較演算子<も同様に記述する
print(a > b)

a = 7
b = 10
# 比較演算子>を使用して、aがbより小さい場合はFalseを返す
print(a > b)


a = 10
b = 10
# 比較演算子>=を使用して、aがbと同じ場合はTrueを返す。比較演算子<=も同様に記述する
print(a >= b)

a = 12
b = 8
# 比較演算子>=を使用して、aがbより大きい場合はTrueを返す
print(a >= b)

a = 9
b = 10
# 比較演算子>=を使用して、aがbより小さい場合はFalseを返す
print(a >= b)